Revit 2024 API
SpecTypeId.PipingFriction Property
 Friction, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingFriction { get; }
Visual Basic
Public Shared ReadOnly Property PipingFriction As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingFriction {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace